app/RoleUserPolicy.php

SELECT * FROM `role_users` WHERE `role_users`.`user_id` = '1' and `role_users`.`user_id` IS not NULL
---
    public function role($id){
        foreach(session()->get('roles') as $role){