app/Http/Controllers/PageController.php

    public function index(){
        $pages = Page::where('user_id', Auth::user()->id)->get();
---
SELECT * FROM `pages` WHERE `user_id` = '1'

    public function store(Request $request){
        $page = new Page();

        $page->title = $request->input('title');
        $page->description = $request->input('description');
        $page->user_id = Auth::user()->id;

        if($request->file('image')){
            $image = $request->file('image');
            $imageFullName = $image->getClientOriginalName();
            $imageName = pathinfo($imageFullName, PATHINFO_FILENAME);
            $extension = $image->getClientOriginalExtension();
            $file = time(). '_' . $imageName . '.' . $extension;
            $image->storeAs('public/pages/'.Auth::user()->id, $file);

        }
        else{
            $file = 'default_page.png';
        }

        $page->image = $file;

        $page->save();
---
INSERT INTO `pages` (`title`, `description`, `user_id`, `image`, `updated_at`, `created_at`) VALUES ('test', 'dqzd', '1', 'default_page.png', '2021-01-19 10:03:59', '2021-01-19 10:03:59')